aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
typedef enum {
  ISM330DHCX_XL_AND_GY_NOT_AFFECTED      = 0,
  ISM330DHCX_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  ISM330DHCX_XL_12Hz5_GY_SLEEP           = 2,
  ISM330DHCX_XL_12Hz5_GY_PD              = 3,
} ism330dhcx_inact_en_t;
int32_t ism330dhcx_act_mode_set(stmdev_ctx_t *ctx,
                                ism330dhcx_inact_en_t val);
int32_t ism330dhcx_act_mode_get(stmdev_ctx_t *ctx,
                                ism330dhcx_inact_en_t *val);

int32_t ism330dhcx_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_detection_on_z_set(stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_z_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_detection_on_y_set(stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_y_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_detection_on_x_set(stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_x_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_threshold_x_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_x_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum {
  ISM330DHCX_XYZ = 0,
  ISM330DHCX_YXZ = 1,
  ISM330DHCX_XZY = 2,
  ISM330DHCX_ZYX = 3,
  ISM330DHCX_YZX = 5,
  ISM330DHCX_ZXY = 6,
} ism330dhcx_tap_priority_t;
int32_t ism330dhcx_tap_axis_priority_set(stmdev_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t val);
int32_t ism330dhcx_tap_axis_priority_get(stmdev_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t *val);

int32_t ism330dhcx_tap_threshold_y_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_y_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_tap_threshold_z_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_z_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_ONLY_SINGLE        = 0,
  ISM330DHCX_BOTH_SINGLE_DOUBLE = 1,
} ism330dhcx_single_double_tap_t;
int32_t ism330dhcx_tap_mode_set(stmdev_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t val);
int32_t ism330dhcx_tap_mode_get(stmdev_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t *val);

typedef enum {
  ISM330DHCX_DEG_80  = 0,
  ISM330DHCX_DEG_70  = 1,
  ISM330DHCX_DEG_60  = 2,
  ISM330DHCX_DEG_50  = 3,
} ism330dhcx_sixd_ths_t;
int32_t ism330dhcx_6d_threshold_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t val);
int32_t ism330dhcx_6d_threshold_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t *val);

int32_t ism330dhcx_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_FF_TSH_156mg = 0,
  ISM330DHCX_FF_TSH_219mg = 1,
  ISM330DHCX_FF_TSH_250mg = 2,
  ISM330DHCX_FF_TSH_312mg = 3,
  ISM330DHCX_FF_TSH_344mg = 4,
  ISM330DHCX_FF_TSH_406mg = 5,
  ISM330DHCX_FF_TSH_469mg = 6,
  ISM330DHCX_FF_TSH_500mg = 7,
} ism330dhcx_ff_ths_t;
int32_t ism330dhcx_ff_threshold_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t val);
int32_t ism330dhcx_ff_threshold_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t *val);

int32_t ism330dhcx_ff_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_ff_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_fifo_watermark_set(stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t ism330dhcx_fifo_watermark_get(stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t ism330dhcx_compression_algo_init_set(stmdev_ctx_t *ctx,
                                             uint8_t val);
int32_t ism330dhcx_compression_algo_init_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

typedef enum {
  ISM330DHCX_CMP_DISABLE  = 0x00,
  ISM330DHCX_CMP_ALWAYS   = 0x04,
  ISM330DHCX_CMP_8_TO_1   = 0x05,
  ISM330DHCX_CMP_16_TO_1  = 0x06,
  ISM330DHCX_CMP_32_TO_1  = 0x07,
} ism330dhcx_uncoptr_rate_t;
int32_t ism330dhcx_compression_algo_set(stmdev_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t val);
int32_t ism330dhcx_compression_algo_get(stmdev_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t *val);

int32_t ism330dhcx_fifo_virtual_sens_odr_chg_set(stmdev_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism330dhcx_fifo_virtual_sens_odr_chg_get(stmdev_ctx_t *ctx,
                                                 uint8_t *val);

int32_t ism330dhcx_compression_algo_real_time_set(stmdev_ctx_t *ctx,
                                                  uint8_t val);
int32_t ism330dhcx_compression_algo_real_time_get(stmdev_ctx_t *ctx,
                                                  uint8_t *val);

int32_t ism330dhcx_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

