aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
int32_t ism330dhcx_sh_batch_slave_3_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_sh_batch_slave_3_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum {
  ISM330DHCX_DEN_DISABLE    = 0,
  ISM330DHCX_LEVEL_FIFO     = 6,
  ISM330DHCX_LEVEL_LETCHED  = 3,
  ISM330DHCX_LEVEL_TRIGGER  = 2,
  ISM330DHCX_EDGE_TRIGGER   = 4,
} ism330dhcx_den_mode_t;
int32_t ism330dhcx_den_mode_set(stmdev_ctx_t *ctx,
                                ism330dhcx_den_mode_t val);
int32_t ism330dhcx_den_mode_get(stmdev_ctx_t *ctx,
                                ism330dhcx_den_mode_t *val);

typedef enum {
  ISM330DHCX_DEN_ACT_LOW  = 0,
  ISM330DHCX_DEN_ACT_HIGH = 1,
} ism330dhcx_den_lh_t;
int32_t ism330dhcx_den_polarity_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_den_lh_t val);
int32_t ism330dhcx_den_polarity_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_den_lh_t *val);

typedef enum {
  ISM330DHCX_STAMP_IN_GY_DATA     = 0,
  ISM330DHCX_STAMP_IN_XL_DATA     = 1,
  ISM330DHCX_STAMP_IN_GY_XL_DATA  = 2,
} ism330dhcx_den_xl_g_t;
int32_t ism330dhcx_den_enable_set(stmdev_ctx_t *ctx,
                                  ism330dhcx_den_xl_g_t val);
int32_t ism330dhcx_den_enable_get(stmdev_ctx_t *ctx,
                                  ism330dhcx_den_xl_g_t *val);

int32_t ism330dhcx_den_mark_axis_x_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_x_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_den_mark_axis_y_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_y_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_den_mark_axis_z_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_z_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_pedo_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_pedo_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_pedo_step_detect_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t ism330dhcx_pedo_debounce_steps_set(stmdev_ctx_t *ctx,
                                           uint8_t *buff);
int32_t ism330dhcx_pedo_debounce_steps_get(stmdev_ctx_t *ctx,
                                           uint8_t *buff);

int32_t ism330dhcx_pedo_steps_period_set(stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t ism330dhcx_pedo_steps_period_get(stmdev_ctx_t *ctx,
                                         uint16_t *val);

typedef enum {
  ISM330DHCX_EVERY_STEP     = 0,
  ISM330DHCX_COUNT_OVERFLOW = 1,
} ism330dhcx_carry_count_en_t;
int32_t ism330dhcx_pedo_int_mode_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t val);
int32_t ism330dhcx_pedo_int_mode_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t *val);

int32_t ism330dhcx_motion_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_motion_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_motion_flag_data_ready_get(stmdev_ctx_t *ctx,
                                              uint8_t *val);

int32_t ism330dhcx_tilt_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tilt_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tilt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t ism330dhcx_mag_sensitivity_set(stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t ism330dhcx_mag_sensitivity_get(stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t ism330dhcx_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t ism330dhcx_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t ism330dhcx_mag_soft_iron_set(stmdev_ctx_t *ctx,
                                     uint16_t *val);
int32_t ism330dhcx_mag_soft_iron_get(stmdev_ctx_t *ctx,
                                     uint16_t *val);

typedef enum {
  ISM330DHCX_Z_EQ_Y     = 0,
  ISM330DHCX_Z_EQ_MIN_Y = 1,
  ISM330DHCX_Z_EQ_X     = 2,
  ISM330DHCX_Z_EQ_MIN_X = 3,
  ISM330DHCX_Z_EQ_MIN_Z = 4,
  ISM330DHCX_Z_EQ_Z     = 5,
} ism330dhcx_mag_z_axis_t;
int32_t ism330dhcx_mag_z_orient_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t val);
int32_t ism330dhcx_mag_z_orient_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t *val);

typedef enum {
  ISM330DHCX_Y_EQ_Y     = 0,
  ISM330DHCX_Y_EQ_MIN_Y = 1,
  ISM330DHCX_Y_EQ_X     = 2,
  ISM330DHCX_Y_EQ_MIN_X = 3,
  ISM330DHCX_Y_EQ_MIN_Z = 4,
  ISM330DHCX_Y_EQ_Z     = 5,
} ism330dhcx_mag_y_axis_t;
int32_t ism330dhcx_mag_y_orient_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t val);
int32_t ism330dhcx_mag_y_orient_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t *val);

typedef enum {
  ISM330DHCX_X_EQ_Y     = 0,
  ISM330DHCX_X_EQ_MIN_Y = 1,
  ISM330DHCX_X_EQ_X     = 2,
  ISM330DHCX_X_EQ_MIN_X = 3,
  ISM330DHCX_X_EQ_MIN_Z = 4,
  ISM330DHCX_X_EQ_Z     = 5,
} ism330dhcx_mag_x_axis_t;
int32_t ism330dhcx_mag_x_orient_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t val);
int32_t ism330dhcx_mag_x_orient_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t *val);

int32_t ism330dhcx_long_cnt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                                uint8_t *val);

int32_t ism330dhcx_emb_fsm_en_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_emb_fsm_en_get(stmdev_ctx_t *ctx, uint8_t *val);

